; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-2-1-3-3-3-5) (:domain depots)
(:objects
	depot0 depot1 - Depot
	distributor0 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 pallet2 - Pallet
	crate0 crate1 crate2 crate3 crate4 - Crate
	hoist0 hoist1 hoist2 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate4)
	(at pallet1 depot1)
	(clear crate1)
	(at pallet2 distributor0)
	(clear pallet2)
	(at truck0 distributor0)
	(at truck1 distributor0)
	(at truck2 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 distributor0)
	(available hoist2)
	(at crate0 depot1)
	(on crate0 pallet1)
	(at crate1 depot1)
	(on crate1 crate0)
	(at crate2 depot0)
	(on crate2 pallet0)
	(at crate3 depot0)
	(on crate3 crate2)
	(at crate4 depot0)
	(on crate4 crate3)
)

(:goal (and
		(on crate0 crate3)
		(on crate1 pallet0)
		(on crate2 crate0)
		(on crate3 pallet1)
	)
))

; plan
1. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (available hoist0) (on crate4 crate3) (clear crate4)
   added: (lifting hoist0 crate4) (clear crate3)
   goals met: 0 of 4
2. (load hoist0 crate4 truck2 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck2) (available hoist0)
   goals met: 0 of 4
3. (lift hoist0 crate3 crate2 depot0)
   deleted: (at crate3 depot0) (available hoist0) (on crate3 crate2) (clear crate3)
   added: (lifting hoist0 crate3) (clear crate2)
   goals met: 0 of 4
4. (load hoist0 crate3 truck2 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck2) (available hoist0)
   goals met: 0 of 4
5. (lift hoist0 crate2 pallet0 depot0)
   deleted: (at crate2 depot0) (available hoist0) (on crate2 pallet0) (clear crate2)
   added: (lifting hoist0 crate2) (clear pallet0)
   goals met: 0 of 4
6. (load hoist0 crate2 truck2 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck2) (available hoist0)
   goals met: 0 of 4
7. (lift hoist1 crate1 crate0 depot1)
   deleted: (at crate1 depot1) (available hoist1) (on crate1 crate0) (clear crate1)
   added: (lifting hoist1 crate1) (clear crate0)
   goals met: 0 of 4
8. (drive truck2 depot0 depot1)
   deleted: (at truck2 depot0)
   added: (at truck2 depot1)
   goals met: 0 of 4
9. (load hoist1 crate1 truck2 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck2) (available hoist1)
   goals met: 0 of 4
10. (lift hoist1 crate0 pallet1 depot1)
   deleted: (at crate0 depot1) (available hoist1) (on crate0 pallet1) (clear crate0)
   added: (lifting hoist1 crate0) (clear pallet1)
   goals met: 0 of 4
11. (load hoist1 crate0 truck2 depot1)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck2) (available hoist1)
   goals met: 0 of 4
12. (unload hoist1 crate3 truck2 depot1)
   deleted: (available hoist1) (in crate3 truck2)
   added: (lifting hoist1 crate3)
   goals met: 0 of 4
13. (drop hoist1 crate3 pallet1 depot1)
   deleted: (lifting hoist1 crate3) (clear pallet1)
   added: (at crate3 depot1) (available hoist1) (on crate3 pallet1) (clear crate3)
   goals met: 1 of 4
14. (unload hoist1 crate0 truck2 depot1)
   deleted: (available hoist1) (in crate0 truck2)
   added: (lifting hoist1 crate0)
   goals met: 1 of 4
15. (drop hoist1 crate0 crate3 depot1)
   deleted: (lifting hoist1 crate0) (clear crate3)
   added: (at crate0 depot1) (available hoist1) (on crate0 crate3) (clear crate0)
   goals met: 2 of 4
16. (unload hoist1 crate2 truck2 depot1)
   deleted: (available hoist1) (in crate2 truck2)
   added: (lifting hoist1 crate2)
   goals met: 2 of 4
17. (drive truck2 depot1 depot0)
   deleted: (at truck2 depot1)
   added: (at truck2 depot0)
   goals met: 2 of 4
18. (drop hoist1 crate2 crate0 depot1)
   deleted: (lifting hoist1 crate2) (clear crate0)
   added: (at crate2 depot1) (available hoist1) (on crate2 crate0) (clear crate2)
   goals met: 3 of 4
19. (unload hoist0 crate1 truck2 depot0)
   deleted: (available hoist0) (in crate1 truck2)
   added: (lifting hoist0 crate1)
   goals met: 3 of 4
20. (drop hoist0 crate1 pallet0 depot0)
   deleted: (lifting hoist0 crate1) (clear pallet0)
   added: (at crate1 depot0) (available hoist0) (on crate1 pallet0) (clear crate1)
   goals met: 4 of 4
